app/Controllers/Client/DashboardController.php

    public function index()
    {
        $userId = session()->get('user_id');

        $userModel        = new UserModel();
        $soldeModel        = new SoldeModel();
        $transactionModel  = new TransactionModel();

        $user  = $userModel->find($userId);
        $solde = $soldeModel->where('idUser', $userId)->first();

        $dernieresTransactions = $transactionModel
            ->where('idUser', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->find();
---
SELECT *
FROM `user`
WHERE `user`.`id` = 5
SELECT *
FROM `solde`
WHERE `idUser` = 5
 LIMIT 1
SELECT *
FROM `transaction`
WHERE `idUser` = 5
ORDER BY `created_at` DESC
 LIMIT 5