app/Controllers/Admin/ClientController.php

SELECT `user`.*, `solde`.`value` AS `soldeValue`, GROUP_CONCAT(numero.numero) AS numeros
FROM `user`
LEFT JOIN `solde` ON `solde`.`idUser` = `user`.`id`
LEFT JOIN `numero` ON `numero`.`iduser` = `user`.`id`
WHERE `user`.`idrole` = 2
GROUP BY `user`.`id`
ORDER BY `user`.`nom` ASC
---
    public function index()
    {
        $recherche = trim((string) $this->request->getGet('q'));

        $roleClient = (new RoleModel())->findByType('client');
        $idRole     = $roleClient['id'] ?? 0;

        $builder = (new UserModel())
            ->select('user.*, solde.value AS soldeValue, GROUP_CONCAT(numero.numero) AS numeros')
            ->join('solde', 'solde.idUser = user.id', 'left')
            ->join('numero', 'numero.iduser = user.id', 'left')
            ->where('user.idrole', $idRole)
            ->groupBy('user.id');

        if ($recherche !== '') {
            $builder = $builder->groupStart()
                ->like('user.nom', $recherche)
                ->orLike('user.CIN', $recherche)
                ->orLike('numero.numero', $recherche)
                ->groupEnd();
        }

        $clients = $builder->orderBy('user.nom', 'ASC')->find();