app/Controllers/Admin/ConfigController.php

    public function modifier(int $id)
    {
        $configModel = new ConfigModel();
        $bareme = $configModel->find($id);
---
SELECT *
FROM `config`
WHERE `config`.`id` = 1