app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `transaction`
---
    public function index()
    {
        $transactionModel = new TransactionModel();
        $roleModel        = new RoleModel();

        $totalGains             = $transactionModel->totalGains();
        $totalTransactions      = $transactionModel->countAllResults();