app/Models/ConfigModel.php

SELECT *
FROM `config`
ORDER BY `min` ASC
---
    public function listeTriee(): array
    {
        return $this->orderBy('min', 'ASC')->findAll();