app/Models/EmpruntModel.php

INSERT INTO `emprunts` (`livre_id`, `user_id`, `nom_emprunteur`, `status`, `date_emprunt`, `date_retour_prevue`, `date_retour`) VALUES (14, 3, 'Marie', 1, '2026-04-27 17:55:41', '2026-05-11 17:55:41', NULL)
---
    public function createEmprunt(int $livreId, int $userId, string $nomEmprunteur, ?string $dateRetourPrevue = null): bool
    {
        $dateRetourPrevue = $dateRetourPrevue ?? date('Y-m-d H:i:s', strtotime('+14 days'));

        return $this->insert([
            'livre_id' => $livreId,
            'user_id' => $userId,
            'nom_emprunteur' => $nomEmprunteur,
            'status' => 1,
            'date_emprunt' => date('Y-m-d H:i:s'),
            'date_retour_prevue' => $dateRetourPrevue,
            'date_retour' => null,
        ]) !== false;

SELECT `emprunts`.*, `livres`.`titre` AS `livre_titre`, `user`.`nom` AS `user_nom`, DATEDIFF(NOW(), emprunts.date_retour_prevue) AS retard_jours
FROM `emprunts`
LEFT JOIN `livres` ON `livres`.`id` = `emprunts`.`livre_id`
LEFT JOIN `user` ON `user`.`id` = `emprunts`.`user_id`
WHERE `emprunts`.`status` = 1
AND `emprunts`.`date_retour_prevue` < '2026-04-27 17:55:19'
ORDER BY `retard_jours` DESC
---
    public function getRetardsActifs(): array
    {
        return $this->select(
            'emprunts.*, livres.titre AS livre_titre, user.nom AS user_nom, DATEDIFF(NOW(), emprunts.date_retour_prevue) AS retard_jours'
        )
            ->join('livres', 'livres.id = emprunts.livre_id', 'left')
            ->join('user', 'user.id = emprunts.user_id', 'left')
            ->where('emprunts.status', 1)
            ->where('emprunts.date_retour_prevue <', date('Y-m-d H:i:s'))
            ->orderBy('retard_jours', 'DESC')
            ->findAll();

SELECT `livres`.`id`, `livres`.`titre`, COUNT(emprunts.id) AS total_emprunts
FROM `emprunts`
LEFT JOIN `livres` ON `livres`.`id` = `emprunts`.`livre_id`
GROUP BY `livres`.`id`, `livres`.`titre`
ORDER BY `total_emprunts` DESC
 LIMIT 10
---
    public function getMostBorrowedBooks(int $limit = 10): array
    {
        return $this->select('livres.id, livres.titre, COUNT(emprunts.id) AS total_emprunts')
            ->join('livres', 'livres.id = emprunts.livre_id', 'left')
            ->groupBy('livres.id, livres.titre')
            ->orderBy('total_emprunts', 'DESC')
            ->limit($limit)
            ->findAll();

SELECT `user`.`id`, `user`.`nom`, `user`.`email`, COUNT(emprunts.id) AS total_emprunts
FROM `emprunts`
LEFT JOIN `user` ON `user`.`id` = `emprunts`.`user_id`
GROUP BY `user`.`id`, `user`.`nom`, `user`.`email`
ORDER BY `total_emprunts` DESC
 LIMIT 10
---
    public function getMostActiveBorrowers(int $limit = 10): array
    {
        return $this->select('user.id, user.nom, user.email, COUNT(emprunts.id) AS total_emprunts')
            ->join('user', 'user.id = emprunts.user_id', 'left')
            ->groupBy('user.id, user.nom, user.email')
            ->orderBy('total_emprunts', 'DESC')
            ->limit($limit)
            ->findAll();