app/Models/LivreModel.php

    public function getLivresPagines(int $perPage = 10, string $group = 'default', ?string $sort = null, ?string $dir = null): array
    {
        [$sortColumn, $sortDirection] = $this->resolveSort($sort, $dir);

        return $this->orderBy($sortColumn, $sortDirection)->paginate($perPage, $group);
---
SELECT *
FROM `livres`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `livres`

    public function getLivreById(int $id): ?array
    {
        return $this->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 14

    public function updateStatut(int $id, string $statut): bool
    {
        return $this->update($id, ['statut' => $statut]);
---
UPDATE `livres` SET `statut` = 'prete', `updated_at` = '2026-04-27 17:55:41'
WHERE `livres`.`id` IN (14)

    public function rechercherLivres(?string $motCle = null, ?string $categorie = null, ?string $sort = null, ?string $dir = null): array
    {
        $motCle = trim((string) $motCle);
        $categorie = trim((string) $categorie);
        [$sortColumn, $sortDirection] = $this->resolveSort($sort, $dir);

        $builder = $this->builder();

        if ($motCle !== '') {
            $builder->groupStart()
                ->like('titre', $motCle)
                ->orLike('auteur', $motCle)
                ->groupEnd();
        }

        if ($categorie !== '') {
            $builder->where('categorie', $categorie);
        }

        return $builder
            ->orderBy($sortColumn, $sortDirection)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `livres`
ORDER BY `created_at` DESC

    public function getAuteursTexteByLivreId(int $livreId): string
    {
        $rows = $this->db->table('livre_auteur')
            ->select('auteurs.nom')
            ->join('auteurs', 'auteurs.id = livre_auteur.auteur_id', 'inner')
            ->where('livre_auteur.livre_id', $livreId)
            ->orderBy('auteurs.nom', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `auteurs`.`nom`
FROM `livre_auteur`
INNER JOIN `auteurs` ON `auteurs`.`id` = `livre_auteur`.`auteur_id`
WHERE `livre_auteur`.`livre_id` = 14
ORDER BY `auteurs`.`nom` ASC

    public function enrichLivresWithAuteurs(array $livres): array
    {
        if ($livres === []) {
            return $livres;
        }

        $ids = array_map(static fn (array $livre): int => (int) ($livre['id'] ?? 0), $livres);
        $ids = array_values(array_filter($ids, static fn (int $id): bool => $id > 0));

        if ($ids === []) {
            return $livres;
        }

        $rows = $this->db->table('livre_auteur')
            ->select('livre_auteur.livre_id, auteurs.nom')
            ->join('auteurs', 'auteurs.id = livre_auteur.auteur_id', 'inner')
            ->whereIn('livre_auteur.livre_id', $ids)
            ->orderBy('auteurs.nom', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `livre_auteur`.`livre_id`, `auteurs`.`nom`
FROM `livre_auteur`
INNER JOIN `auteurs` ON `auteurs`.`id` = `livre_auteur`.`auteur_id`
WHERE `livre_auteur`.`livre_id` IN (14,15,16,17,18,19,20,21,22,23)
ORDER BY `auteurs`.`nom` ASC

    public function getCategoriesDisponibles(): array
    {
        $result = $this->builder()
            ->select('categorie')
            ->where('categorie IS NOT NULL', null, false)
            ->where('categorie !=', '')
            ->groupBy('categorie')
            ->orderBy('categorie', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `categorie`
FROM `livres`
WHERE categorie IS NOT NULL
AND `categorie` != ''
GROUP BY `categorie`
ORDER BY `categorie` ASC