app/Models/NumeroModel.php

SELECT *
FROM `numero`
WHERE `numero` = '0372222222'
 LIMIT 1
---
    public function findByNumero(string $numero)
    {
        return $this->where('numero', $numero)->first();