app/Models/PrefixeModel.php

SELECT `numero`
FROM `prefixe`
---
    public function listeActifs(): array
    {
        return $this->select('numero')->findAll();

SELECT `prefixe`.*, `operateur`.`nom` AS `operateurNom`
FROM `prefixe`
LEFT JOIN `operateur` ON `operateur`.`id` = `prefixe`.`idoperateur`
ORDER BY `prefixe`.`numero` ASC
---
    public function findAllMe()
    {
        return $this
            ->select('prefixe.*, operateur.nom AS operateurNom')
            ->join('operateur', 'operateur.id = prefixe.idoperateur', 'left')
            ->orderBy('prefixe.numero', 'ASC')
            ->find();