app/Models/ReservationModel.php

SELECT `livre_id`
FROM `reservations`
WHERE `user_id` = 3
AND `status` IN ('en_attente','notifiee')
---
    public function getActiveMapByUserId(int $userId): array
    {
        $rows = $this->select('livre_id')
            ->where('user_id', $userId)
            ->whereIn('status', ['en_attente', 'notifiee'])
            ->findAll();

SELECT `livre_id`, COUNT(*) AS total
FROM `reservations`
WHERE `livre_id` IN (14,15,16,17,18,19,20,21,22,23)
AND `status` = 'en_attente'
GROUP BY `livre_id`
---
    public function getQueueCountsByLivreIds(array $livreIds): array
    {
        if ($livreIds === []) {
            return [];
        }

        $rows = $this->select('livre_id, COUNT(*) AS total')
            ->whereIn('livre_id', $livreIds)
            ->where('status', 'en_attente')
            ->groupBy('livre_id')
            ->findAll();

UPDATE `reservations` SET `status` = 'terminee', `updated_at` = '2026-04-27 17:55:41'
WHERE `livre_id` = 14
AND `user_id` = 3
AND `status` IN ('en_attente','notifiee')
---
    public function resolveForUser(int $livreId, int $userId): bool
    {
        return $this->where('livre_id', $livreId)
            ->where('user_id', $userId)
            ->whereIn('status', ['en_attente', 'notifiee'])
            ->set(['status' => 'terminee'])
            ->update();