app/Models/RoleModel.php

SELECT *
FROM `role`
WHERE `type` = 'client'
 LIMIT 1
---
    public function findByType(string $type)
    {
        return $this->where('type', $type)->first();

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `idrole` = 2
---
    public function totalClients()
    {
        $userModel = new UserModel();
        $roleClient = $this->findByType('client');
        if ($roleClient) {
            return $userModel->where('idrole', $roleClient['id'])->countAllResults();