app/Models/SoldeModel.php

    public function ligneSolde(int $idUser): ?array
    {
        return $this->where('idUser', $idUser)->first();
---
SELECT *
FROM `solde`
WHERE `idUser` = 5
 LIMIT 1