app/Models/TransactionModel.php

    public function dernieresAvecClient(int $limite = 8): array
    {
        return $this->builderAvecAlias()
            ->select('tr.*, user.nom AS clientNom, typeOperation.nom AS typeNom')
            ->join('user', 'user.id = tr.idUser', 'left')
            ->join('typeOperation', 'typeOperation.id = tr.idTypeOperation', 'left')
            ->orderBy('tr.created_at', 'DESC')
            ->limit($limite)
            ->get()
            ->getResultArray();
---
SELECT `tr`.*, `user`.`nom` AS `clientNom`, `typeOperation`.`nom` AS `typeNom`
FROM `transaction` `tr`
LEFT JOIN `user` ON `user`.`id` = `tr`.`idUser`
LEFT JOIN `typeOperation` ON `typeOperation`.`id` = `tr`.`idTypeOperation`
ORDER BY `tr`.`created_at` DESC
 LIMIT 8

    public function nombreAujourdhui(): int
    {
        return $this->builderAvecAlias()
            ->where('DATE(tr.created_at)', date('Y-m-d'))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaction` `tr`
WHERE DATE(tr.created_at) = '2026-07-20'

    public function gainsParType(array $filtres = []): array
    {
        $builder = $this->builderAvecAlias()
            ->select('typeOperation.nom AS typeNom, SUM(tr.gain) AS total, COUNT(tr.id) AS nombre')
            ->join('typeOperation', 'typeOperation.id = tr.idTypeOperation', 'left')
            ->groupBy('tr.idTypeOperation');

        if (! empty($filtres['dateDebut'])) {
            $builder = $builder->where('tr.created_at >=', $filtres['dateDebut'] . ' 00:00:00');
        }
        if (! empty($filtres['dateFin'])) {
            $builder = $builder->where('tr.created_at <=', $filtres['dateFin'] . ' 23:59:59');
        }

        return $builder->get()->getResultArray();
---
SELECT SUM(`tr`.`gain`) AS `total`
FROM `transaction` `tr`