app/Models/TypeOperationModel.php

SELECT *
FROM `typeOperation`
ORDER BY `nom` ASC
---
    public function filtreByNom(){
        return $this->orderBy('nom', 'ASC')->findAll();